In [1]:
import pandas 
import cx_Oracle

sql = "select * from hca.doctors"

con = cx_Oracle.connect('hca/hca@192.168.0.112/ORCL')
dataset = pandas.read_sql(sql , con)
con.close()

#### Esté código describe la conexión a una base de datos mediante sqlalquemy

In [2]:
dataset

   DOC_ID DOC_LAST_NAME   DOC_FIRST_NAME  MSP_ID
0       1       Chamale     Oscar El¿¿as       1
1       2        Lozano        Alejandro       2
2       3       Berardi   Yanina Viviana       2
3       4     Bertolino    Mar¿¿a Lorena       3
4       5      Consigli  Nicolas Ernesto       4
5       6     Antonelli           Romina       5
6       7    Bartolacci            In¿¿s       6
7       8         Majul          Enrique       6

In [5]:
dataset.describe()

        DOC_ID   MSP_ID
count  8.00000  8.00000
mean   4.50000  3.62500
std    2.44949  1.92261
min    1.00000  1.00000
25%    2.75000  2.00000
50%    4.50000  3.50000
75%    6.25000  5.25000
max    8.00000  6.00000

In [6]:
dataset['DOC_LAST_NAME']

0       Chamale
1        Lozano
2       Berardi
3     Bertolino
4      Consigli
5     Antonelli
6    Bartolacci
7         Majul
Name: DOC_LAST_NAME, dtype: object

In [7]:
dataset['DOC_LAST_NAME'][0]='Rodriguez'

/home/drobins/dao/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [8]:
dataset

   DOC_ID DOC_LAST_NAME   DOC_FIRST_NAME  MSP_ID
0       1     Rodriguez     Oscar El¿¿as       1
1       2        Lozano        Alejandro       2
2       3       Berardi   Yanina Viviana       2
3       4     Bertolino    Mar¿¿a Lorena       3
4       5      Consigli  Nicolas Ernesto       4
5       6     Antonelli           Romina       5
6       7    Bartolacci            In¿¿s       6
7       8         Majul          Enrique       6